/*Написати програму для обробки даних, організованих у масив, згідно завдання наведеного варіанту. У програмах 
використати різні форми звертання до елементів багатовимірних масивів, у тому числі за допомогою конструкцій 
“вказівник на масив” і “вказівник на вказівник”.Враховувати, що кожен рядок матриці можна опрацьовувати 
як окремий елемент. Для прямокутної матриці X[5][7] обчислити скалярний добуток рядка, в якому знаходиться 
максимальний елемент матриці і стовпця, в якому знаходиться мінімальний елемент матриці.*/
#include <stdio.h>
int main(){
    int matr[5][7] = {{2, 7, 1, 1, 10, 7, 3}, {1, 1, 4, 7, 39, 65, 3}, {45, 3, 0, 9, 3, 1, 1}, {23, 4, 6, 5, 3, 2, 40}, {2, 2, 2, 4, 5, 4, 5}};
    int max = matr[0][0];
    int min = matr[0][0];
    int maxrow = 0, mincol = 0;

    for (int i = 0; i < 5; i++) {
        for (int j = 0; j < 7; j++) {
            if (*(*(matr + i) + j) > max) {
                max = *(*(matr + i) + j);
                maxrow = i;
            }
            if (*(*(matr + i) + j) < min) {
                min = *(*(matr + i) + j);
                mincol = j;
            }
        }
    }

    printf("Max element: %d in row %d\n", max, maxrow);
    printf("Min element: %d in column %d\n", min, mincol);

    int *ptrs[5]; //Вказівник на рядки
    for (int i = 0; i < 5; i++) {
        ptrs[i] = matr[i];
    }

    int scalar = 0;
    for (int i = 0; i < 5; i++) { // по кількості рядків
        scalar += ptrs[maxrow][i] * ptrs[i][mincol];
    }

    printf("Skalyarnyy dobutok: %d\n", scalar);
    return 0;
}
